RoutesAndControllers/app/controllers/users_controller.rb

    def create
        user = User.new(params.require(:user).permit(:name, :email))
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fucker"], ["email", "imafuckwit"], ["created_at", "2023-06-08 14:15:02.361327"], ["updated_at", "2023-06-08 14:15:02.361327"]]

    def update
        user = User.find(params[:id])
        if user.update(user_parameter)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "amanda"], ["email", "amanda@snailmail.com"], ["updated_at", "2023-06-08 14:09:59.036129"], ["id", 44]]

    def destroy
        user = User.find(params[:id])

        user.delete
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]